{
  "modelTopology": {
    "keras_version": "2.1.4",
    "model_config": {
      "class_name": "Model",
      "config": {
        "input_layers": [
          ["input_1", 0, 0]
        ],
        "output_layers": [
          ["conv2d_10", 0, 0],
          ["conv2d_13", 0, 0]
        ],
        "name": "model_1",
        "layers": [{
          "class_name": "InputLayer",
          "config": {
            "sparse": false,
            "dtype": "float32",
            "name": "input_1",
            "batch_input_shape": [null, null, null, 3]
          },
          "name": "input_1",
          "inbound_nodes": []
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 16,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_1",
            "trainable": true
          },
          "name": "conv2d_1",
          "inbound_nodes": [
            [
              ["input_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_1",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_1",
          "inbound_nodes": [
            [
              ["conv2d_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "name": "leaky_re_lu_1",
          "inbound_nodes": [
            [
              ["batch_normalization_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_1",
            "trainable": true
          },
          "name": "max_pooling2d_1",
          "inbound_nodes": [
            [
              ["leaky_re_lu_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 32,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_2",
            "trainable": true
          },
          "name": "conv2d_2",
          "inbound_nodes": [
            [
              ["max_pooling2d_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_2",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_2",
          "inbound_nodes": [
            [
              ["conv2d_2", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "name": "leaky_re_lu_2",
          "inbound_nodes": [
            [
              ["batch_normalization_2", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_2",
            "trainable": true
          },
          "name": "max_pooling2d_2",
          "inbound_nodes": [
            [
              ["leaky_re_lu_2", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_3",
            "trainable": true
          },
          "name": "conv2d_3",
          "inbound_nodes": [
            [
              ["max_pooling2d_2", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_3",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_3",
          "inbound_nodes": [
            [
              ["conv2d_3", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "name": "leaky_re_lu_3",
          "inbound_nodes": [
            [
              ["batch_normalization_3", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_3",
            "trainable": true
          },
          "name": "max_pooling2d_3",
          "inbound_nodes": [
            [
              ["leaky_re_lu_3", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_4",
            "trainable": true
          },
          "name": "conv2d_4",
          "inbound_nodes": [
            [
              ["max_pooling2d_3", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_4",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_4",
          "inbound_nodes": [
            [
              ["conv2d_4", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "name": "leaky_re_lu_4",
          "inbound_nodes": [
            [
              ["batch_normalization_4", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_4",
            "trainable": true
          },
          "name": "max_pooling2d_4",
          "inbound_nodes": [
            [
              ["leaky_re_lu_4", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 256,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_5",
            "trainable": true
          },
          "name": "conv2d_5",
          "inbound_nodes": [
            [
              ["max_pooling2d_4", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_5",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_5",
          "inbound_nodes": [
            [
              ["conv2d_5", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "name": "leaky_re_lu_5",
          "inbound_nodes": [
            [
              ["batch_normalization_5", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_5",
            "trainable": true
          },
          "name": "max_pooling2d_5",
          "inbound_nodes": [
            [
              ["leaky_re_lu_5", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 512,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_6",
            "trainable": true
          },
          "name": "conv2d_6",
          "inbound_nodes": [
            [
              ["max_pooling2d_5", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_6",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_6",
          "inbound_nodes": [
            [
              ["conv2d_6", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_6",
            "trainable": true
          },
          "name": "leaky_re_lu_6",
          "inbound_nodes": [
            [
              ["batch_normalization_6", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "MaxPooling2D",
          "config": {
            "padding": "same",
            "data_format": "channels_last",
            "pool_size": [2, 2],
            "strides": [1, 1],
            "name": "max_pooling2d_6",
            "trainable": true
          },
          "name": "max_pooling2d_6",
          "inbound_nodes": [
            [
              ["leaky_re_lu_6", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 1024,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_7",
            "trainable": true
          },
          "name": "conv2d_7",
          "inbound_nodes": [
            [
              ["max_pooling2d_6", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_7",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_7",
          "inbound_nodes": [
            [
              ["conv2d_7", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_7",
            "trainable": true
          },
          "name": "leaky_re_lu_7",
          "inbound_nodes": [
            [
              ["batch_normalization_7", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 256,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_8",
            "trainable": true
          },
          "name": "conv2d_8",
          "inbound_nodes": [
            [
              ["leaky_re_lu_7", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_8",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_8",
          "inbound_nodes": [
            [
              ["conv2d_8", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_8",
            "trainable": true
          },
          "name": "leaky_re_lu_8",
          "inbound_nodes": [
            [
              ["batch_normalization_8", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_11",
            "trainable": true
          },
          "name": "conv2d_11",
          "inbound_nodes": [
            [
              ["leaky_re_lu_8", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_10",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_10",
          "inbound_nodes": [
            [
              ["conv2d_11", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_10",
            "trainable": true
          },
          "name": "leaky_re_lu_10",
          "inbound_nodes": [
            [
              ["batch_normalization_10", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "size": [2, 2],
            "name": "up_sampling2d_1",
            "trainable": true
          },
          "name": "up_sampling2d_1",
          "inbound_nodes": [
            [
              ["leaky_re_lu_10", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "name": "concatenate_1",
          "inbound_nodes": [
            [
              ["up_sampling2d_1", 0, 0, {}],
              ["leaky_re_lu_5", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 512,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_9",
            "trainable": true
          },
          "name": "conv2d_9",
          "inbound_nodes": [
            [
              ["leaky_re_lu_8", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": false,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 256,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_12",
            "trainable": true
          },
          "name": "conv2d_12",
          "inbound_nodes": [
            [
              ["concatenate_1", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_9",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_9",
          "inbound_nodes": [
            [
              ["conv2d_9", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "BatchNormalization",
          "config": {
            "epsilon": 0.001,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "center": true,
            "momentum": 0.99,
            "axis": -1,
            "gamma_constraint": null,
            "scale": true,
            "gamma_regularizer": null,
            "name": "batch_normalization_11",
            "beta_regularizer": null,
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_constraint": null,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "trainable": true
          },
          "name": "batch_normalization_11",
          "inbound_nodes": [
            [
              ["conv2d_12", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_9",
            "trainable": true
          },
          "name": "leaky_re_lu_9",
          "inbound_nodes": [
            [
              ["batch_normalization_9", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_11",
            "trainable": true
          },
          "name": "leaky_re_lu_11",
          "inbound_nodes": [
            [
              ["batch_normalization_11", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": true,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 255,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_10",
            "trainable": true
          },
          "name": "conv2d_10",
          "inbound_nodes": [
            [
              ["leaky_re_lu_9", 0, 0, {}]
            ]
          ]
        }, {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "kernel_constraint": null,
            "use_bias": true,
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l2": 0.0005000000237487257,
                "l1": 0.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "padding": "same",
            "data_format": "channels_last",
            "bias_regularizer": null,
            "filters": 255,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "scale": 1.0,
                "seed": null,
                "mode": "fan_avg"
              }
            },
            "dilation_rate": [1, 1],
            "name": "conv2d_13",
            "trainable": true
          },
          "name": "conv2d_13",
          "inbound_nodes": [
            [
              ["leaky_re_lu_11", 0, 0, {}]
            ]
          ]
        }]
      }
    },
    "backend": "tensorflow"
  },
  "weightsManifest": [{
    "weights": [{
      "shape": [16],
      "dtype": "float32",
      "name": "batch_normalization_1/gamma"
    }, {
      "shape": [16],
      "dtype": "float32",
      "name": "batch_normalization_1/beta"
    }, {
      "shape": [16],
      "dtype": "float32",
      "name": "batch_normalization_1/moving_mean"
    }, {
      "shape": [16],
      "dtype": "float32",
      "name": "batch_normalization_1/moving_variance"
    }],
    "paths": ["group1-shard1of1"]
  }, {
    "weights": [{
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_10/gamma"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_10/beta"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_10/moving_mean"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_10/moving_variance"
    }],
    "paths": ["group2-shard1of1"]
  }, {
    "weights": [{
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_11/gamma"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_11/beta"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_11/moving_mean"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_11/moving_variance"
    }],
    "paths": ["group3-shard1of1"]
  }, {
    "weights": [{
      "shape": [32],
      "dtype": "float32",
      "name": "batch_normalization_2/gamma"
    }, {
      "shape": [32],
      "dtype": "float32",
      "name": "batch_normalization_2/beta"
    }, {
      "shape": [32],
      "dtype": "float32",
      "name": "batch_normalization_2/moving_mean"
    }, {
      "shape": [32],
      "dtype": "float32",
      "name": "batch_normalization_2/moving_variance"
    }],
    "paths": ["group4-shard1of1"]
  }, {
    "weights": [{
      "shape": [64],
      "dtype": "float32",
      "name": "batch_normalization_3/gamma"
    }, {
      "shape": [64],
      "dtype": "float32",
      "name": "batch_normalization_3/beta"
    }, {
      "shape": [64],
      "dtype": "float32",
      "name": "batch_normalization_3/moving_mean"
    }, {
      "shape": [64],
      "dtype": "float32",
      "name": "batch_normalization_3/moving_variance"
    }],
    "paths": ["group5-shard1of1"]
  }, {
    "weights": [{
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_4/gamma"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_4/beta"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_4/moving_mean"
    }, {
      "shape": [128],
      "dtype": "float32",
      "name": "batch_normalization_4/moving_variance"
    }],
    "paths": ["group6-shard1of1"]
  }, {
    "weights": [{
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_5/gamma"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_5/beta"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_5/moving_mean"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_5/moving_variance"
    }],
    "paths": ["group7-shard1of1"]
  }, {
    "weights": [{
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_6/gamma"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_6/beta"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_6/moving_mean"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_6/moving_variance"
    }],
    "paths": ["group8-shard1of1"]
  }, {
    "weights": [{
      "shape": [1024],
      "dtype": "float32",
      "name": "batch_normalization_7/gamma"
    }, {
      "shape": [1024],
      "dtype": "float32",
      "name": "batch_normalization_7/beta"
    }, {
      "shape": [1024],
      "dtype": "float32",
      "name": "batch_normalization_7/moving_mean"
    }, {
      "shape": [1024],
      "dtype": "float32",
      "name": "batch_normalization_7/moving_variance"
    }],
    "paths": ["group9-shard1of1"]
  }, {
    "weights": [{
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_8/gamma"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_8/beta"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_8/moving_mean"
    }, {
      "shape": [256],
      "dtype": "float32",
      "name": "batch_normalization_8/moving_variance"
    }],
    "paths": ["group10-shard1of1"]
  }, {
    "weights": [{
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_9/gamma"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_9/beta"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_9/moving_mean"
    }, {
      "shape": [512],
      "dtype": "float32",
      "name": "batch_normalization_9/moving_variance"
    }],
    "paths": ["group11-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 3, 16],
      "dtype": "float32",
      "name": "conv2d_1/kernel"
    }],
    "paths": ["group12-shard1of1"]
  }, {
    "weights": [{
      "shape": [1, 1, 512, 255],
      "dtype": "float32",
      "name": "conv2d_10/kernel"
    }, {
      "shape": [255],
      "dtype": "float32",
      "name": "conv2d_10/bias"
    }],
    "paths": ["group13-shard1of1"]
  }, {
    "weights": [{
      "shape": [1, 1, 256, 128],
      "dtype": "float32",
      "name": "conv2d_11/kernel"
    }],
    "paths": ["group14-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 384, 256],
      "dtype": "float32",
      "name": "conv2d_12/kernel"
    }],
    "paths": ["group15-shard1of1"]
  }, {
    "weights": [{
      "shape": [1, 1, 256, 255],
      "dtype": "float32",
      "name": "conv2d_13/kernel"
    }, {
      "shape": [255],
      "dtype": "float32",
      "name": "conv2d_13/bias"
    }],
    "paths": ["group16-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 16, 32],
      "dtype": "float32",
      "name": "conv2d_2/kernel"
    }],
    "paths": ["group17-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 32, 64],
      "dtype": "float32",
      "name": "conv2d_3/kernel"
    }],
    "paths": ["group18-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 64, 128],
      "dtype": "float32",
      "name": "conv2d_4/kernel"
    }],
    "paths": ["group19-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 128, 256],
      "dtype": "float32",
      "name": "conv2d_5/kernel"
    }],
    "paths": ["group20-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 256, 512],
      "dtype": "float32",
      "name": "conv2d_6/kernel"
    }],
    "paths": ["group21-shard1of2", "group21-shard2of2"]
  }, {
    "weights": [{
      "shape": [3, 3, 512, 1024],
      "dtype": "float32",
      "name": "conv2d_7/kernel"
    }],
    "paths": ["group22-shard1of5", "group22-shard2of5", "group22-shard3of5", "group22-shard4of5", "group22-shard5of5"]
  }, {
    "weights": [{
      "shape": [1, 1, 1024, 256],
      "dtype": "float32",
      "name": "conv2d_8/kernel"
    }],
    "paths": ["group23-shard1of1"]
  }, {
    "weights": [{
      "shape": [3, 3, 256, 512],
      "dtype": "float32",
      "name": "conv2d_9/kernel"
    }],
    "paths": ["group24-shard1of2", "group24-shard2of2"]
  }]
}