{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_11/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_12/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_13/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_15/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_16/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_17/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_19/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "batch_normalization_20/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "batch_normalization_21/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "batch_normalization_22/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "batch_normalization_23/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "batch_normalization_24/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "batch_normalization_25/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "batch_normalization_26/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "batch_normalization_27/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "batch_normalization_28/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "batch_normalization_29/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "batch_normalization_30/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "batch_normalization_31/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "batch_normalization_32/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "batch_normalization_33/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_33/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_33/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_33/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "batch_normalization_34/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_34/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_34/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_34/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "batch_normalization_35/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_35/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_35/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_35/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"name": "batch_normalization_36/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"name": "batch_normalization_38/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"name": "batch_normalization_39/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"name": "batch_normalization_40/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"name": "batch_normalization_41/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_41/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_41/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_41/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"name": "batch_normalization_42/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"name": "batch_normalization_43/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_43/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_43/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_43/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"name": "batch_normalization_44/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_44/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_44/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_44/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"name": "batch_normalization_45/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_45/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_45/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_45/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"name": "batch_normalization_46/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_46/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_46/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_46/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"name": "batch_normalization_47/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_47/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_47/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_47/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"name": "batch_normalization_48/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_48/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_48/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_48/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"name": "batch_normalization_49/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_49/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_49/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_49/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"name": "batch_normalization_50/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_50/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_50/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_50/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"name": "batch_normalization_51/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_51/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_51/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_51/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"name": "batch_normalization_52/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_52/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_52/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_52/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"name": "batch_normalization_53/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_53/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_53/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_53/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"name": "batch_normalization_54/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_54/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_54/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_54/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group51-shard1of1"], "weights": [{"name": "batch_normalization_55/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group52-shard1of1"], "weights": [{"name": "batch_normalization_56/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group53-shard1of1"], "weights": [{"name": "batch_normalization_57/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group54-shard1of1"], "weights": [{"name": "batch_normalization_58/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_58/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_58/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_58/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group55-shard1of1"], "weights": [{"name": "batch_normalization_59/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_59/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_59/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_59/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group56-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group57-shard1of1"], "weights": [{"name": "batch_normalization_60/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group58-shard1of1"], "weights": [{"name": "batch_normalization_61/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_61/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_61/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_61/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group59-shard1of1"], "weights": [{"name": "batch_normalization_62/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_62/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_62/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_62/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group60-shard1of1"], "weights": [{"name": "batch_normalization_63/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_63/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_63/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_63/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group61-shard1of1"], "weights": [{"name": "batch_normalization_64/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_64/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_64/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_64/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group62-shard1of1"], "weights": [{"name": "batch_normalization_65/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_65/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_65/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_65/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group63-shard1of1"], "weights": [{"name": "batch_normalization_66/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_66/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_66/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_66/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group64-shard1of1"], "weights": [{"name": "batch_normalization_67/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_67/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group65-shard1of1"], "weights": [{"name": "batch_normalization_68/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_68/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_68/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_68/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group66-shard1of1"], "weights": [{"name": "batch_normalization_69/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group67-shard1of1"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group68-shard1of1"], "weights": [{"name": "batch_normalization_70/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group69-shard1of1"], "weights": [{"name": "batch_normalization_71/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_71/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_71/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_71/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group70-shard1of1"], "weights": [{"name": "batch_normalization_72/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_72/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_72/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_72/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group71-shard1of1"], "weights": [{"name": "batch_normalization_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group72-shard1of1"], "weights": [{"name": "batch_normalization_9/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group73-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}]}, {"paths": ["group74-shard1of1"], "weights": [{"name": "conv2d_10/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group75-shard1of1"], "weights": [{"name": "conv2d_11/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group76-shard1of1"], "weights": [{"name": "conv2d_12/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group77-shard1of1"], "weights": [{"name": "conv2d_13/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group78-shard1of1"], "weights": [{"name": "conv2d_14/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group79-shard1of1"], "weights": [{"name": "conv2d_15/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group80-shard1of1"], "weights": [{"name": "conv2d_16/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group81-shard1of1"], "weights": [{"name": "conv2d_17/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group82-shard1of1"], "weights": [{"name": "conv2d_18/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group83-shard1of1"], "weights": [{"name": "conv2d_19/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group84-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}]}, {"paths": ["group85-shard1of1"], "weights": [{"name": "conv2d_20/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group86-shard1of1"], "weights": [{"name": "conv2d_21/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group87-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group88-shard1of1"], "weights": [{"name": "conv2d_23/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group89-shard1of1"], "weights": [{"name": "conv2d_24/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group90-shard1of1"], "weights": [{"name": "conv2d_25/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group91-shard1of1"], "weights": [{"name": "conv2d_26/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group92-shard1of2", "group92-shard2of2"], "weights": [{"name": "conv2d_27/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group93-shard1of1"], "weights": [{"name": "conv2d_28/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group94-shard1of2", "group94-shard2of2"], "weights": [{"name": "conv2d_29/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group95-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}]}, {"paths": ["group96-shard1of1"], "weights": [{"name": "conv2d_30/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group97-shard1of2", "group97-shard2of2"], "weights": [{"name": "conv2d_31/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group98-shard1of1"], "weights": [{"name": "conv2d_32/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group99-shard1of2", "group99-shard2of2"], "weights": [{"name": "conv2d_33/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group100-shard1of1"], "weights": [{"name": "conv2d_34/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group101-shard1of2", "group101-shard2of2"], "weights": [{"name": "conv2d_35/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group102-shard1of1"], "weights": [{"name": "conv2d_36/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group103-shard1of2", "group103-shard2of2"], "weights": [{"name": "conv2d_37/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group104-shard1of1"], "weights": [{"name": "conv2d_38/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group105-shard1of2", "group105-shard2of2"], "weights": [{"name": "conv2d_39/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group106-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}]}, {"paths": ["group107-shard1of1"], "weights": [{"name": "conv2d_40/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group108-shard1of2", "group108-shard2of2"], "weights": [{"name": "conv2d_41/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group109-shard1of1"], "weights": [{"name": "conv2d_42/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group110-shard1of2", "group110-shard2of2"], "weights": [{"name": "conv2d_43/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group111-shard1of5", "group111-shard2of5", "group111-shard3of5", "group111-shard4of5", "group111-shard5of5"], "weights": [{"name": "conv2d_44/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group112-shard1of1"], "weights": [{"name": "conv2d_45/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group113-shard1of5", "group113-shard2of5", "group113-shard3of5", "group113-shard4of5", "group113-shard5of5"], "weights": [{"name": "conv2d_46/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group114-shard1of1"], "weights": [{"name": "conv2d_47/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group115-shard1of5", "group115-shard2of5", "group115-shard3of5", "group115-shard4of5", "group115-shard5of5"], "weights": [{"name": "conv2d_48/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group116-shard1of1"], "weights": [{"name": "conv2d_49/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group117-shard1of1"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}]}, {"paths": ["group118-shard1of5", "group118-shard2of5", "group118-shard3of5", "group118-shard4of5", "group118-shard5of5"], "weights": [{"name": "conv2d_50/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group119-shard1of1"], "weights": [{"name": "conv2d_51/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group120-shard1of5", "group120-shard2of5", "group120-shard3of5", "group120-shard4of5", "group120-shard5of5"], "weights": [{"name": "conv2d_52/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group121-shard1of1"], "weights": [{"name": "conv2d_53/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group122-shard1of5", "group122-shard2of5", "group122-shard3of5", "group122-shard4of5", "group122-shard5of5"], "weights": [{"name": "conv2d_54/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group123-shard1of1"], "weights": [{"name": "conv2d_55/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group124-shard1of5", "group124-shard2of5", "group124-shard3of5", "group124-shard4of5", "group124-shard5of5"], "weights": [{"name": "conv2d_56/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group125-shard1of1"], "weights": [{"name": "conv2d_57/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}]}, {"paths": ["group126-shard1of5", "group126-shard2of5", "group126-shard3of5", "group126-shard4of5", "group126-shard5of5"], "weights": [{"name": "conv2d_58/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group127-shard1of1"], "weights": [{"name": "conv2d_59/kernel", "shape": [1, 1, 1024, 255], "dtype": "float32"}, {"name": "conv2d_59/bias", "shape": [255], "dtype": "float32"}]}, {"paths": ["group128-shard1of1"], "weights": [{"name": "conv2d_6/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}]}, {"paths": ["group129-shard1of1"], "weights": [{"name": "conv2d_60/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group130-shard1of1"], "weights": [{"name": "conv2d_61/kernel", "shape": [1, 1, 768, 256], "dtype": "float32"}]}, {"paths": ["group131-shard1of2", "group131-shard2of2"], "weights": [{"name": "conv2d_62/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group132-shard1of1"], "weights": [{"name": "conv2d_63/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group133-shard1of2", "group133-shard2of2"], "weights": [{"name": "conv2d_64/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group134-shard1of1"], "weights": [{"name": "conv2d_65/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}]}, {"paths": ["group135-shard1of2", "group135-shard2of2"], "weights": [{"name": "conv2d_66/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group136-shard1of1"], "weights": [{"name": "conv2d_67/kernel", "shape": [1, 1, 512, 255], "dtype": "float32"}, {"name": "conv2d_67/bias", "shape": [255], "dtype": "float32"}]}, {"paths": ["group137-shard1of1"], "weights": [{"name": "conv2d_68/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group138-shard1of1"], "weights": [{"name": "conv2d_69/kernel", "shape": [1, 1, 384, 128], "dtype": "float32"}]}, {"paths": ["group139-shard1of1"], "weights": [{"name": "conv2d_7/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}]}, {"paths": ["group140-shard1of1"], "weights": [{"name": "conv2d_70/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group141-shard1of1"], "weights": [{"name": "conv2d_71/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group142-shard1of1"], "weights": [{"name": "conv2d_72/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group143-shard1of1"], "weights": [{"name": "conv2d_73/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group144-shard1of1"], "weights": [{"name": "conv2d_74/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group145-shard1of1"], "weights": [{"name": "conv2d_75/kernel", "shape": [1, 1, 256, 255], "dtype": "float32"}, {"name": "conv2d_75/bias", "shape": [255], "dtype": "float32"}]}, {"paths": ["group146-shard1of1"], "weights": [{"name": "conv2d_8/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}]}, {"paths": ["group147-shard1of1"], "weights": [{"name": "conv2d_9/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.1.4", "model_config": {"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 416, 416, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_1", "filters": 32, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_1"}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"trainable": true, "padding": [[1, 0], [1, 0]], "name": "zero_padding2d_1", "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "name": "zero_padding2d_1"}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [2, 2], "name": "conv2d_2", "filters": 64, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_2"}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_3", "filters": 32, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_3"}, {"inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_4", "filters": 64, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_4"}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation", "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "padding": [[1, 0], [1, 0]], "name": "zero_padding2d_2", "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "name": "zero_padding2d_2"}, {"inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [2, 2], "name": "conv2d_5", "filters": 128, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_5", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_5"}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_6", "filters": 64, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_6", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_6"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_6"}, {"inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_7", "filters": 128, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D", "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "name": "batch_normalization_7", "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_7"}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}], ["leaky_re_lu_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "linear", "name": "activation_2"}, "class_name": "Activation", "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "name": "conv2d_8", 